test/artillery.config.yml
config:
  target: 'http://127.0.0.1:8080/api'
  processor: 'processor.js'
  phases:
    - duration: 30 # for 30 sec
      arrivalRate: 20 # generate 10 virtual users every second
      # maxVusers: 5 # max concurrent virtual users

scenarios:
  - name: 'Get sign predictions'
    flow:
      - post:
          url: '/predict-and-ocr'
          beforeRequest: 'setupMultipartFormData'